import pytest

from src.services import description_filter, investment_bank
from src.utils import XLSX_file_read

data = [
    {
        "Дата операции": "10.01.2018 21:31:46",
        "Дата платежа": "11.01.2018",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -2.75,
        "Валюта операции": "EUR",
        "Сумма платежа": -191.13,
        "Валюта платежа": "RUB",
        "Кэшбэк": 0,
        "Категория": "Топливо",
        "MCC": 5541.0,
        "Описание": "Circle K",
        "Бонусы (включая кэшбэк)": 3,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 191.13,
    },
    {
        "Дата операции": "10.01.2018 19:10:56",
        "Дата платежа": "12.01.2018",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -1041.74,
        "Валюта операции": "RUB",
        "Сумма платежа": -1041.74,
        "Валюта платежа": "RUB",
        "Кэшбэк": 0,
        "Категория": "Различные товары",
        "MCC": 5311.0,
        "Описание": "DutyFree",
        "Бонусы (включая кэшбэк)": 20,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 1041.74,
    },
    {
        "Дата операции": "10.01.2018 16:53:21",
        "Дата платежа": "11.01.2018",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -634.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -634.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": 0,
        "Категория": "Рестораны",
        "MCC": 5812.0,
        "Описание": "Stedroll",
        "Бонусы (включая кэшбэк)": 12,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 634.0,
    },
    {
        "Дата операции": "10.01.2018 12:43:34",
        "Дата платежа": "10.01.2018",
        "Номер карты": "*5441",
        "Статус": "FAILED",
        "Сумма операции": -30068.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -30068.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": 0,
        "Категория": None,
        "MCC": None,
        "Описание": "Перевод с карты",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 30068.0,
    },
]


def test_description_filter():
    assert description_filter(data, "Супер") == "[]"
    assert description_filter(data, "Рестораны") == (
        '[{"Дата операции": "10.01.2018 16:53:21", "Дата платежа": "11.01.2018", '
        '"Номер карты": "*7197", "Статус": "OK", "Сумма операции": -634.0, "Валюта '
        'операции": "RUB", "Сумма платежа": -634.0, "Валюта платежа": "RUB", '
        '"Кэшбэк": 0, "Категория": "Рестораны", "MCC": 5812.0, "Описание": '
        '"Stedroll", "Бонусы (включая кэшбэк)": 12, "Округление на инвесткопилку": 0, '
        '"Сумма операции с округлением": 634.0}]'
    )


@pytest.mark.parametrize(
    "transaction, date, limit, expected",
    [
        ("2019-08", XLSX_file_read(), 50, 2352.29),
        ("2019-07", XLSX_file_read(), 50, 2933.26),
        ("2020-11", XLSX_file_read(), 50, 3160.69),
    ],
)
def test_investment_bank(transaction, date, limit, expected):
    assert investment_bank(transaction, date, limit) == expected
